Repository: BekhruzAshurmatov/mywebsite
Catalog: home/locale/*/LC_MESSAGES/django.po
Languages: uz

source: About Us
uz: Biz haqimizda

source: Our courses offer a good compromise between the continuous assessment favoured by some universities and the emphasis placed on final exams by others.
uz: Bizning kurslarimiz ba'zi universitetlar tomonidan qo'llab-quvvatlanadigan doimiy baholash va boshqalar tomonidan yakuniy imtihonlarga e'tibor qaratish o'rtasida yaxshi murosani taklif qiladi.

source: ABOUT OUR JOURNEY
uz: BIZNING SAYOHAT HAQIDA

source: TEACHERS
uz: O'QITUVCHILAR

source: COURSES
uz: KURSLAR

source: STUDENTS
uz: STUDENTLAR

source: SATISFIED CLIENTS
uz: Qoniqarli mijozlar

source: Success Stories
uz: Muvaffaqiyatli hikoyalar

source: Your bright future is our mission
uz: Sizning yorqin kelajagingiz bizning vazifamizdir

source: Apply now
uz: Hoziroq ro'yhatdan o'ting

source: Contact Us
uz: Bog'lanish

source: Do you have other questions? Don't worry, there aren't any dumb questions. Just fill out the form below, and we'll get back to you as soon as possible.
uz: Boshqa savollaringiz bormi? Xavotir olmang, ahmoqona savollar yo'q. Quyidagi shaklni toâ€˜ldiring, biz sizga imkon qadar tezroq javob beramiz.

source: SEND MESSAGE
uz: XABAR YUBORISH

source: Scholarship News
uz: Grantlar haqida yangiliklar

source: Our Notice Board
uz: Bizning E'lonlar

source: Our Achievements
uz: Bizning Yutuqlar

source: Admission Now
uz: Qabul davom etmoqda

source: About Educenter
uz: O'quv markaz haqida

source: Learn more
uz: Batafsil ma'lumot

source: Our Courses
uz: Bizning Kurslar

source: see all
uz: barchasini ko'rish

source: sell all
uz: barchasini sotish

source: Click to Join the Advance Workshop
uz: Ilg'or seminarga qo'shilish uchun bosing

source: Training In Advance Networking
uz: Advance Networking bo'yicha trening

source: join now
uz: Hoziroq qo'shilish

source: Upcoming Events
uz: Bo'lajak voqealar

source: December
uz: Dekabr

source: Harvard, Usa
uz: Garvard, AQSH

source: Toward a public philosophy of justice
uz: Ommaviy adolat falsafasi tomon

source: Cambridge, Usa
uz: Kembridj, AQSH

source: Research seminar in clinical science.
uz: Klinik fan bo'yicha tadqiqot seminari.

source: Dhanmondi Lake, Dhaka
uz: Dhanmondi ko'li, Dakka

source: Firefly training in trauma-informed yoga
uz: Shikastlangan yoga bo'yicha o't chirog'ini tayyorlash

source: Our Teachers
uz: Bizning O'qituvchilar

source: Teacher
uz: O'qituvchi

source: Latest News
uz: So'ngi yangiliklar

source: August 28, 2019
uz: 28 Avgust, 2019

source: By Jonathon
uz: Jonaton

source: The Expenses You Are Thinking.
uz: Siz o'ylagan xarajatlar.

source: read more
uz: batafsil

source: August 13, 2019
uz: 13 Avgust, 2019

source: By Jonathon Drew
uz: Jonaton Dryu

source: Tips to Succeed in an Online Course
uz: Onlayn kursda muvaffaqiyat qozonish uchun tiplar

source: August 24, 2018
uz: 24 Avgust, 2018

source: By Alex Pitt
uz: Aleks Pitt

source: Orientation Program for the new students
uz: Yangi talabalar uchun orientatsiya dasturi

source: Subscribe Now
uz: Hoziroq obuna bo'ling

source: Join
uz: Qo'shilish

source: COMPANY
uz: KOMPANIYA

source: Our Teacher
uz: Bizning O'qituvchi

source: Contact
uz: Kontakt

source: LINKS
uz: HAVOLALAR

source: Courses
uz: Kurslar

source: Events
uz: Iventlar

source: Gallery
uz: Galereya

source: FAQs
uz: Tez-tez so'raladigan savollar

source: SUPPORT
uz: Qo'llab-quvvatlash

source: Forums
uz: Forumlar

source: Documentation
uz: Hujjatlar

source: Language
uz: Til

source: Release Status
uz: Chiqarish holati

source: RECOMMEND
uz: Tavsiya qilish

source: CALL
uz: Qong'iroq qilish xizmati

source: notice
uz: bildirishnoma

source: research
uz: tadqiqot

source: SCHOLARSHIP
uz: Stipendiya

source: register
uz: ro'yxatdan o'tish

source: HOME
uz: ASOSIY

source: ABOUT
uz: BIZ HAQIMIZDA

source: TUTORS
uz: MUALLIMLAR

source: CONTACTS
uz: KONTAKT

source: Our Students
uz: Bizning Oq'uvchilar

source: arts
uz: san'at

source: biological science
uz: biologiya

source: business studies
uz: biznes

source: law
uz: qonun

source: pharmacy
uz: farmatsevtika

source: science
uz: ilm-fan

source: social science
uz: ijtimoiy fan

source: Subjects
uz: Mavzular

source: 06 Month
uz: 06 Oy

source: DURATION
uz: Davomiyligi

source: 03 Hours
uz: 03 Soat

source: FEE
uz: NARXI

source: From: $699
uz: $699 dan

source: About Course
uz: Kurs Haqida

source: Requirements
uz: Talablar

source: How to Apply
uz: Qanday qurojaat qilish

source: Fees and Funding
uz: To'lovlar va Mablag'lar

source: Social Link
uz: Ijtimoiy Aloqa

source: More
uz: Batafsil
